# Задача 16: Требуется вычислить, сколько раз встречается некоторое число X в массиве A[1..N]. 
# Пользователь в первой строке вводит натуральное число N – количество элементов в массиве. 
# В последующих  строках записаны N целых чисел Ai. Последняя строка содержит число X
# *Пример:*
# 5
#     1 2 3 4 5
#     3
#     -> 1

import random
N = int(input('Введите длинну массива: '))
count = 0
t = []
for i in range(N):
    t.append(random.randint(0,10))
print(t)
Number = int(input('Введите число для поиска: '))
for i in range(N):
    if t[i] == Number: count = count + 1
print(f'Число {Number} повторяется {count} раз(а).')